Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/debt/personal_insolvency/debt_relief_notices.html.txt.tmx
Source language: en
Languages: ga

source: • How does a Debt Relief Notice work?
ga: • Conas mar a oibríonn Fógra um Fhaoiseamh Fiachais?

source: • How do I get a Debt Relief Notice?
ga: • Conas a fhaighim Fógra um Fhaoiseamh Fiachais?

source: A Debt Relief Notice (DRN) is one of 3 debt resolution mechanisms introduced under the Personal Insolvency Act 2012 for people who cannot afford to pay their personal debts
ga: Tá Fógra um Fhaoiseamh Fiachais (DRN) ar cheann de thrí mheicníocht nua réitigh fiachais atá á socrú faoin Acht um Dhócmhainneacht Phearsanta, 2012 do dhaoine nach bhfuil in ann íoc as a bhfiachas pearsanta

source: These arrangements offer different solutions to people in different situations
ga: Cuireann na socruithe seo réitigh dhifriúla ar fáil do dhaoine i gcásanna éagsúla

source: The Debt Relief Notice is designed for people who have very low disposable income or assets
ga: Tá an Fógra um Fhaoiseamh Fiachais ann chun freastal ar dhaoine a bhfuil ioncam nó sócmhainní indiúscartha an-ísle acu

source: It allows for the write-off of qualifying debt up to a certain limit, subject to a 3-year supervision period
ga: Ceadaíonn sé díscríobh fiachais cháilithigh suas go h-uasteorainn faoi réir tréimhse mhaoirseachta 3 bliana

source: This upper limit was originally €20,000
ga: Ba í €20,000 an uasteorainn ar dtús

source: Under the Personal Insolvency (Amendment) Act 2015 the limit has increased to €35,000 with effect from 29 September 2015
ga: Faoin Acht um Dhócmhainneact Pearsanta (Leasú) 2015 méadaíodh an uasteorainn go €35,000 ó 29 Meán Fómhair 2015

source: This document describes how to qualify for a DRN and how the process works
ga: Déantar cur síos sa cháipéis seo ar conas cáiliú do DRN agus ar conas a n-oibríonn an próiseas

source: The Insolvency Service of Ireland has published information about Debt Relief Notices, including FAQs, a guidebook and a set of possible scenarios
ga: Tá faisnéis foilsithe ag Seirbhís Dócmhainneachta na hÉireann (SDÉ) ar conas a oibríonn DRNanna lena n-áirítear ceisteanna coitianta, treoirleabhar agus sraith cásanna féideartha

source: It also provides extra information on DRNs, including a quick guide (pdf) on its website backontrack.ie, aimed at people who are struggling with debt
ga: Cuireann SDÉ breis eolais ar DRNanna ar fáil ar an láithreán backontrack.ie, atá dírithe ar dhaoine a bhfuil fadhbanna fiachais acu. Ina mheasc sin tá treoir ghearr (pdf)

source: You can read a general overview of personal insolvency options here
ga: Féadfaidh tú foramharc ginearálta a léamh ar an gcóras dócmhainneachta pearsanta anseo

source: A Debt Relief Notice deals with qualifying debts of up to €35,000 in the case of people who have very low disposable income or assets and no prospect of being able to pay off their debts in the next 3 years
ga: Déileálann Fógraí um Fhaoiseamh Fiachais le fiachas incháilithe a mhéid le €35,000 i gcás daoine ag a bhfuil ioncam nó sócmhainní indiúscartha an-ísle agus nach dócha go mbeidh siad in ann a bhfiachas a íoc sna 3 bliana amach romhainn

source: (As noted above, this upper limit has recently increased from €20,000.)
ga: (Mar a dúradh thuas, méadaíodh an uasteorainn ó €20,000 le déanaí.)

source: You can only avail of a DRN once in your lifetime
ga: Ní féidir leat DRN a fháil ach uair amháin i do shaol

source: You cannot get a DRN if you are involved in one of the other new debt resolution processes, or in the bankruptcy process, or if you have completed such a process within the last 5 years
ga: Ní féidir leat DRN a fháil má tá baint agat i gceann de na próisis eile réitigh fiachais, nó sa phróiseas féimheachta, nó má chríochnaigh tú próiseas den sórt sin le 5 bliana anuas

source: In general, you will only qualify for a DRN if all of your debts are unsecured (apart from exceptional cases, outlined below) and if the total of your debt to all your creditors adds up to €35,000 or less
ga: Go ginearálta, ní cháileofar thú le haghaidh DRN ach amháin mura bhfuil do chuid fiachais faoi urrús (seachas i gcásanna eisceachtúla, ar a dtugtar breac-chuntas thíos) agus más ionann iomlán d’fhiachais atá le híoc le do chuid creidiúnaithe agus €35,000 nó níos lú

source: (Under the Personal Insolvency (Amendment) Act 2015, this limit was increased from €20,000 with effect from 29 September 2015.)
ga: (Faoin Acht um Dhócmhainneact Pearsanta (Leasú) 2015 méadaíodh an uasteorainn ó €20,000 ó 29 Meán Fómhair 2015.)

source: A Debt Relief Notice is mainly designed to cover unsecured debts (though it can include some secured debts – see below) so it is important to know whether your debts are secured or not
ga: Tá Fógra um Fhaoiseamh Fiachais in ainm is fiachas nach bhfuil faoi urrús a chuimsiú, go príomha, (cé gur féidir roinnt fiachais faoi urrús a áireamh - féach thíos), mar sin is tábhachtach fios a bheith agat cibé acu an bhfuil d'fhiachas faoi urrús nó nach bhfuil

source: In general, debts such as the following are unsecured:
ga: Go ginearálta, níl fiachas ar nós iad siúd a leanas faoi urrús:

source: • Utility bill arrears (gas, electricity etc.)
ga: • Riaráistí bille fóntais (gás, leictreachas, etc.)

source: However, if they are rolled up into your mortgage, they become secured loans
ga: Má tá siad in éineacht le do mhorgáiste, áfach, déantar iasachtaí faoi urrús díobh

source: A secured debt is a loan on which property or goods are available as security against non-payment
ga: Iasacht atá i bhfiachas faoi urrús ar a bhfuil fáil ar réadmhaoin nó earraí mar urrús i leith neamhíocaíochta

source: Mortgages and car loans are the most common secured loans
ga: Is iad morgáistí agus iasachtaí gluaisteáin na hiasachtaí is coitianta d’iasachtaí faoi urrús

source: (If you have this type of debt, you cannot get a DRN but you may apply for another personal insolvency option.)
ga: (Má tá an saghas seo fiachais agat, ní féidir leat DRN a fháil ach d’fhéadfá iarratas a dhéanamh ar rogha eile dócmhainneachta pearsanta)

source: However, while a DRN will not cover mortgages or similar large-scale secured debt, in certain exceptional cases a loan may be secured against a small item of property, such as a ring
ga: Cé nach gcuimseoidh DRN morgáistí ná fiachas mórmhéid dá shamhail sin nach bhfuil faoi urrús, áfach, i gcásanna áirithe eisceachtúla, féadtar iasacht a chur faoi urrús i leith earra beag réadmhaoine, ar nós fáinne

source: Such a secured debt can be included in a DRN, but only if the creditor agrees
ga: Féadtar a leithéid d’fhiachas faoi urrús a áireamh in DRN, ach amháin má chomhaontaíonn an creidiúnaí

source: Excluded and excludable debts
ga: Fiachas eisiata agus in-eisiata

source: The Personal Insolvency Act 2012 specifies certain types of debt that cannot be written off by a Debt Relief Notice
ga: Sonraítear san Acht um Dhócmhainneacht Phearsanta, 2012, roinnt saghsanna d’fhiachas nach féidir a dhíscríobh le Fógra um Fhaoiseamh Fiachais

source: These are called excluded debts
ga: Tugtar fiachas eisiata orthu seo

source: The Act specifies certain other types of debt to be excludable from a DRN
ga: Sonraítear san Acht roinnt saghsanna eile d’fhiachas atá in-eisiata ó DRN

source: This means that they can only be covered by the DRN if the creditor is asked and agrees to let them be included – in which case they become permitted debts – debts that the creditor permits to be covered
ga: Ciallaíonn seo nach féidir iad a chuimsiú ag an DRN ach amháin má iarrtar ar an gcreidiúnaí agus má aontaíonn sé/sí le hiad a áireamh – agus sa chás sin, déantar fiachas ceadaithe astu – arb ionann sin agus fiachas a cheadaíonn an creidiúnaí a chuimsiú

source: Most types of excludable debts are those owed to the State
ga: Is fiachas in-eisiata an chuid is mó den fhiachas atá le híoc leis an Stát

source: The types of debt that are excluded are:
ga: Is iad na saghsanna fiachais a eisítear:

source: • Debts under family law orders, such as maintenance orders for spouses and children
ga: • Fiachas faoi orduithe dlí teaghlaigh, ar nós orduithe cothabhála do chéilí agus leanaí

source: • Debts due under court awards for personal injury or death
ga: • Fiachas atá le híoc faoi dhámhachtain chúirte mar gheall ar ghortú pearsanta nó bás

source: • Debts arising from a loan (or forbearance of a loan) obtained through fraud or similar wrongdoing
ga: • Fiachas a eascraíonn ó iasacht (nó staonadh iasachta) a fuarthas mar gheall ar chalaois nó éagóir dá samhail sin

source: • Debts arising under court orders made under the Proceeds of Crime Acts or fines imposed by the courts for criminal offences
ga: • Fiachas a eascraíonn faoi orduithe cúirte a rinneadh faoi na hAchtanna um Fháltais ó Choireacht nó fíneálacha a ghearrann na cúirteanna mar gheall ar chionta coiriúla

source: The types of debt that are excludable are:
ga: Is iad na saghsanna fiachais atá in-eisiata:

source: • Taxes, duties or levies owed to the State, such as income tax, the Local Property Tax, VAT, capital taxes
ga: • Cáin, dleachtanna nó tobhaigh atá le híoc leis an Stát, ar nós cáin ioncaim, na Cánach Maoine Áitiúla nua, CBL, cáin chaipitiúil

source: • Service charges owed to local authorities
ga: • Muirir sheirbhíse atá le híoc le húdaráis áitiúla

source: • Money owed under the Nursing Homes Support Scheme (in respect of a loan advanced by the HSE to a nursing home resident to cover the amount due from the principal private residence)
ga: • Airgead atá le híoc faoin Scéim Tacaíochta do Thithe Altranais (i dtaca le hiasacht a réamhíoc FSS le cónaitheoir i dteach altranais chun íoc as an méid atá le híoc ón bpríomháit chónaithe phríobháideach)

source: • Money owed to the Department of Social Protection
ga: • Airgead atá le híoc leis an Roinn Coimirce Sóisialaí

source: • Debts due to owners’ management companies in respect of annual service charges or contributions due for multi-unit developments (this is the only non-State debt in this category)
ga: • Fiachas atá le híoc le cuideachtaí bainistíochta úinéirí maidir le muirir nó le ranníocaíochtaí bliantúla seirbhíse atá le híoc le haghaidh forbairtí ilaonad (seo an t-aon fhiachas neamhStáit sa chatagóir seo)

source: Income and asset tests
ga: Tástálacha ioncaim agus sócmhainní

source: All of your income will be taken into account, except for Child Benefit
ga: Cuirfear d’ioncam go léir san áireamh, seachas Sochar Linbh

source: Any assets that you have will also be valued
ga: Ina theannta sin, déanfar aon sócmhainní atá agat a luacháil

source: You will only qualify for a DRN if, after deducting certain outgoings, you would be left with a net monthly disposable income of €60 or less
ga: Ní cháileofar thú le haghaidh DRN ach amháin dá bhfágfaí glanioncam míosúil indiúscartha €60 nó níos lú leat tar éis eisíocaíochtaí áirithe a asbhaint

source: The 2 types of outgoings are:
ga: Is iad an dá shaghas eisíocaíochtaí:

source: • Payments in respect of debts that are outside the DRN process – these are either excluded debts that cannot be covered, or excludable debts that the creditor has not agreed to include, as outlined above
ga: • Íocaíochtaí maidir le fiachas atá lasmuigh den phróiseas DRN – ní fiachas eisiata iad seo nach féidir a chuimsiú, ná fiachas in-eisiata nár chomhaontaigh an creidiúnaí a chur san áireamh, amhail a shonraítear thuas

source: • Reasonable living expenses, which will be assessed in accordance with detailed guidelines – see below
ga: • Costais réasúnta mhaireachtála, a dhéanfar a mheasúnú i gcomhréir le treoirlínte sonracha – féach thíos

source: Your net disposable income takes account of your income from salary, wages, pensions and contributions from other household members
ga: Cuirtear san áireamh i do ghlanioncam indiúscartha d’ioncam ó thuarastal, pánna, pinsin agus ranníocaíochtaí ó dhaoine muinteartha eile

source: Any other income available to you is also taken into account – including all social welfare payments except Child Benefit
ga: Ina theannta sin, cuirtear san áireamh aon ioncam eile ar a bhfuil fáil agat – lena n-áirítear gach íocaíocht leasa shóisialaigh seachas Sochar Linbh

source: Deductions are then made for:
ga: Ansin déantar asbhaintí i leith an mhéid a leanas:

source: • Income tax, PRSI and other charges/levies on income (such as Universal Social Charge)
ga: • Cáin ioncaim, ÁSPC agus muirir/tobhaigh eile ar ioncam (ar nós an Mhuirir Shóisialta Uilíoch)

source: • Payments that you make in respect of excluded debts and excludable debts (unless they are permitted debts – see ‘Excluded and excludable debts’ above)
ga: • Íocaíochtaí a rinne tú maidir le fiachas eisiata agus fiachas in-eisiata (mura fiachas ceadaithe iad – féach ‘Fiachas eisiata agus in-eisiata' thuas)

source: • Reasonable living expenses - see below
ga: • Costais réasúnta mhaireachtála – féach thíos

source: The total value of your assets must be €400 or less
ga: Ní mór go mbeidh luach €400 nó níos lú ar luach iomlán do shócmhainní

source: They are assessed at market value and include savings, shares and property
ga: Déantar measúnú orthu de réir luach an mhargaidh agus cuirtear san áireamh leo coigilteas, scaireanna agus réadmhaoin

source: The following assets are not taken into account:
ga: Ní chuirtear na sócmhainní a leanas san áireamh:

source: • Essential household equipment and appliances and books, tools or equipment needed for employment or business, up to a total value of €6,000
ga: • Trealamh agus fearais ríthábhachtacha teaghlaigh agus leabhair, uirlisí nó trealamh a theastaíonn ar mhaithe le fostaíocht nó gnó, a mhéid le luach iomlán €6,000

source: • Books or equipment that are reasonably necessary to enable you or a dependant to participate in and complete a course of education (at primary or secondary level only)
ga: • Leabhair nó trealamh a theastaíonn uait nó ó chleithiúnaí leat go réasúnta chun páirt a ghlacadh i gcúrsa oideachais agus é a chríochnú (ar leibhéal bunscoile nó meánscoile amháin)

source: • A vehicle that has been adapted for a person with a disability (either you or one of your dependants)
ga: • Feithicil a oiriúnaíodh do dhuine atá faoi mhíchumas (tú féin nó duine de do chleithiúnaithe)

source: • A motor vehicle up to a value of €2,000 *
ga: • Mótarfheithicil ar a bhfuil luach uasta €2,000*

source: • One item of personal jewellery to a maximum value of €750 *
ga: • Earra amháin seodra ar a bhfuil luach uasta €750*

source: • Any future pension entitlement or option that you cannot choose to access at present
ga: • Aon teidlíocht nó rogha pinsin amach anseo nach féidir leat roghnú a rochtain faoi láthair

source: * A motor vehicle or piece of jewellery cannot be excluded from the asset test if the cost of buying it forms part of your qualifying debts
ga: *Ní féidir mótarfheithicil nó píosa seodra a eisiamh ón tástáil sócmhainne má chruthaíonn an costas a bhí orthu cuid de d’fhiachas incháilithe

source: Reasonable standard of living/living expenses
ga: Costais réasúnta mhaireachtála/costais mhaireachtála

source: You must be left with enough income to maintain a reasonable standard of living for yourself and your dependants
ga: Níor mhór go bhfágfar leat dóthain ioncaim le caighdeán réasúnta maireachtála a choimeád duit féin agus do do chuid cleithiúnaithe

source: The Insolvency Service of Ireland (ISI) is responsible for drawing up guidelines on what constitutes a reasonable standard of living and reasonable living expenses
ga: Cuireann Seirbhís Dócmhainneachta na hÉireann (ISI) treoirlínte arb éard is caighdeán réasúnta maireachtála agus costais réasúnta mhaireachtála ann i dtoll a chéile

source: The guidelines provide examples of what may and may not be allowed as reasonable living expenses
ga: Cuireann na treoirlínte samplaí ar fáil ar na rudaí is féidir agus nach féidir a cheadú mar chostais réasúnta mhaireachtála

source: They are reviewed every year
ga: Déantar athbhreithniú orthu gach bliain

source: You can use the ISI's reasonable living expenses calculator to find out what your household's monthly expenses would be assessed at
ga: Is féidir an ríomhaire chostais réasúnta mhaireachtála a úsáid chun costais mhíosúla do theaghlaigh fein a ríomh

source: How does a Debt Relief Notice work?
ga: Conas mar a oibríonn Fógra um Fhaoiseamh Fiachais?

source: If a DRN is issued for you, it will allow for the write-off of your qualifying debt up to €35,000 (formerly €20,000) subject to a 3-year supervision period
ga: Má eisítear DRN duit, ceadóidh sé díscríobh do chuid fiachais cháilithigh a mhéid le €35,000 (€20,000 ar dtús) faoi réir tréimhse mhaoirseachta 3 bliana

source: You will still be liable for any excluded debts and for any excludable debts that your creditors have not agreed to include in the DRN - see ‘Excluded and excludable debts’ above
ga: Beidh tú fós faoi dhliteanas íoc as aon fhiachas eisiata agus as aon fhiachas in-eisiata nár aontaigh do chreidiúnaithe a chur san áireamh sa DRN – féach ‘Fiachas eisiata agus in-eisiata’ thuas

source: During the supervision period, you may not get credit of €650 or more from any source, either on your own or as part of a joint application with someone else, without informing that source that you have a Debt Relief Notice
ga: Le linn na tréimhse maoirseachta, ní féidir leat creidmheas €650 nó níos mó a fháil ó aon fhoinse, cibé acu leat féin nó mar chuid de chomhiarratas le duine eile, gan an fhoinse sin a chur ar an eolas go bhfuil Fógra um Fhaoiseamh Fiachais agat

source: You will have to tell the Insolvency Service of any change in your circumstances, for example, any increases in income, assets or liabilities
ga: Beidh ort insint don tSeirbhís Dócmhainneachta faoi aon athrú a thagann ar do chuid cúinsí, mar shampla, aon mhéadú ar ioncam, sócmhainní nó dliteanais

source: If your financial position improves above certain limits, you will have to repay part of your debts – see ‘Paying part of your debts’ below
ga: Má thagann feabhas ar do sheasamh airgeadais os cionn teorainneacha áirithe, beidh ort cuid de d’fhiachas a aisíoc – féach ‘Cuid de d’fhiachas a íoc’ thíos

source: You will also have to tell the ISI if you become aware of any errors or omissions in the documentation included in your application for the DRN
ga: Ina theannta sin, beidh ort insint don ISI má bhíonn tú ar an eolas ar aon earráidí nó easnaimh sa cháipéisíocht a chuirtear san áireamh i d’iarratas ar an DRN

source: The ISI has extensive powers of investigation of anything that it considers relevant to your case
ga: Beidh ag an ISI cumhachtaí fairsinge imscrúdaithe ar aon rud a shíleann siad a bhaineann le do chás

source: The Circuit Court may extend the supervision period in certain circumstances – see ‘Extension or unsuccessful ending of a DRN’ below
ga: Féadfaidh an Chúirt Chuarda an tréimhse mhaoirseachta a shíneadh faoi chúinsí áirithe – féach ‘Síneadh nó deireadh mí-rathúil a chur le DRN’ thíos

source: Details of your DRN will be placed on a public Register of Debt Relief Notices
ga: Cuirfear sonraí ar do DRN ar Chlár poiblí Fógraí um Fhaoiseamh Fiachais

source: The issue of the DRN will be the first official notification to your creditors that you have applied to have your debts written off – except for creditors with excludable debts, who will have to be consulted about having their debts included as permitted debts
ga: Beidh eisiúint an DRN ar an gcéad fhógra oifigiúil a thabharfar do do chuid creidiúnaithe a dheimhneoidh go ndearna tú iarratas go ndéanfar d’fhiachas a dhíscríobh – seachas i gcás creidiúnaithe ag a bhfuil fiachas in-eisiata, nach mór dul i gcomhairle leo faoina bhfiachas a chur san áireamh mar fhiachas ceadaithe

source: Your other creditors can object on certain specified grounds when they receive the DRN – see ‘Objections’ below
ga: Féadfaidh do chreidiúnaithe eile aighneacht a dhéanamh ar bhunúis shonraithe nuair a fhaigheann siad an DRN – féach ‘Aighneachtaí’ thíos

source: During the supervision period, your creditors will not be allowed to pursue any action against you for the recovery of debts covered by the DRN
ga: Le linn na tréimhse maoirseachta, ní cheadófar do do chreidiúnaithe tabhairt faoi aon ghníomhartha i do choinne ar mhaithe le haisghabháil an fhiachais atá faoi chumhdach an DRN

source: This means that your creditors may not:
ga: Ciallaíonn seo nach féidir le do chreidiúnaithe an méid a leanas a dhéanamh:

source: • Initiate or prosecute legal proceedings or
ga: • Tús a chur le himeachtaí dlíthiúla nó iad a ionchúiseamh, nó

source: • Seek to recover payment for a debt or recover goods or
ga: • Aisghabháil íocaíochta a lorg ar fhiachas nó earraí a aisghabháil, nó

source: • Execute or enforce a judgment in respect of a debt
ga: • Breithiúnas a fhorfheidhmiú nó a dhéanamh maidir le fiachas

source: However, if any of your debts were guaranteed by another person, the creditor may take action against that person
ga: Má bhí aon cheann de d’fhiachas faoi urrús ag duine eile, áfach, féadfaidh an creidiúnaí dul i mbun gníomhartha i leith an duine sin

source: Any of your creditors may apply to the Circuit Court if they object to the inclusion of the debts you owe them in the Debt Relief Notice
ga: Féadfaidh aon duine de do chreidiúnaithe iarratas a dhéanamh ar an gCúirt Chuarda má chuireann siad i gcoinne áireamh an fhiachais atá le híoc agat san Fhógra um Fhaoiseamh Fiachais

source: They can only object on the following grounds:
ga: Ní féidir leo aighneacht a dhéanamh ach ar na bunúis a leanas:

source: • You do not meet the eligibility conditions for a DRN
ga: • Ní chomhlíonann tú na coinníollacha incháilitheachta do DRN

source: • Inaccuracies in the documentation on which your application was based
ga: • Míchruinnis sa cháipéisíocht ar ar bunaíodh d’iarratas

source: • You have failed to inform the Insolvency Service of changed circumstances or failed to surrender extra income as required
ga: • Theip ort an tSeirbhís Dócmhainneachta a chur ar an eolas ar chúinsí athraithe nó theip ort ioncam breise a thabhairt suas amhail a cheanglaítear

source: • You have committed an offence under the Personal Insolvency legislation since the DRN came into effect
ga: • Rinne tú cion faoin reachtaíocht um Dhócmhainneacht Phearsanta ó tháinig an DRN i bhfeidhm

source: • The procedural requirements were not followed
ga: • Níor leanadh na ceanglais nós imeachta

source: The Court has the power to make various decisions, including extension or termination of the DRN
ga: Tá sé de chumhacht ag an gCúirt cinntí éagsúla a dhéanamh, lena n-áirítear síneadh nó deireadh a chur leis an DRN

source: The ISI may apply to the Court for withdrawal of the notice on similar grounds and with similar consequences – see ‘Extension or unsuccessful ending of a DRN’ below
ga: Féadfaidh an ISI iarratas a dhéanamh ar an gCúirt ar aistarraingt an fhógra ar a shamhail de bhunúis agus faoi chúinsí samhlacha – féach ‘Síneadh nó deireadh mí-rathúil a chur le DRN’ thíos

source: Paying part of your debts
ga: Cuid de d’fhiachas a íoc

source: If your financial situation improves to a certain extent during the 3-year supervision period, you will have to repay part of your debts
ga: Má thagann feabhas de mhéid áirithe ar do chás airgeadais le linn na tréimhse maoirseachta trí bliana, beidh ort cuid de d’fhiachas a aisíoc

source: • If you get a gift or windfall payment worth €500 or more, you must surrender half of it to the Insolvency Service
ga: • Má fhaigheann tú bronntanas nó íocaíocht amhantair ar fiú €500 nó níos mó é, ní mór duit an leath de a thabhairt suas go dtí an tSeirbhís Dócmhainneachta
